In [2]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

Cargamos las tablas limpias en .parquet

In [47]:
steam_games = pd.read_parquet('Dataset/steam_games.parquet')
user_items = pd.read_parquet('Dataset/user_items.parquet')
user_reviews = pd.read_parquet('Dataset/user_reviews.parquet')

In [66]:
steam_games.head(3)

,item_id,title,genres,genres_len
0,761140,Lost Summoner Kitty,"[Action, Casual, Indie, Simulation, Strategy]",5
1,643980,Ironbound,"[Free to Play, Indie, RPG, Strategy]",4
2,670290,Real Pool 3D - Poolians,"[Casual, Free to Play, Indie, Simulation, Sports]",5

In [48]:
user_items.tail()

,user_id,item_id,title,playtime_forever
4941018,76561198329548331,346330,BrainBread 2,0
4941019,76561198329548331,373330,All Is Dust,0
4941020,76561198329548331,388490,One Way To Die: Steam Edition,3
4941021,76561198329548331,521570,You Have 10 Seconds 2,4
4941022,76561198329548331,519140,Minds Eyes,3

Quitamos la columna **posted** de `user_reviews`

In [68]:
user_reviews.drop(columns='posted', inplace=True)
user_reviews.head()

             user_id  item_id  recommend  sentiment_analysis  year_posted
0  76561197970982479     1250          1                   2         2011
1  76561197970982479    22200          1                   2         2011
2  76561197970982479    43110          1                   2         2011
3            js41637   251610          1                   2         2014
4            js41637   227300          1                   2         2013